app/controllers/videos_controller.rb

  def create
    @video = current_user.videos.build(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdas"], ["description", "asdllkl"], ["created_at", "2019-03-26 12:18:36.003502"], ["updated_at", "2019-03-26 12:18:36.003502"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @video.update(video_params)
---
UPDATE "videos" SET "name" = $1, "updated_at" = $2 WHERE "videos"."id" = $3  [["name", "Video #1"], ["updated_at", "2019-03-26 12:24:43.980440"], ["id", 2]]